{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science, Mathematics, Statistics",
      "duration": "2019-2023",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ModhoopMitra",
  "highlighted_projects": [
    {
      "description": "Developed a full-stack social media web application tailored for restaurant-related interactions, creating a robust platform for users to engage with restaurant profiles, blogs, feeds, and more. Utilized Django on the backend to build and extend models for user and restaurant profiles, blogs, and other features, and used SQLite as the database to store and manage data efficiently. To ensure scalability and flexibility, a REST API was implemented using the Django REST Framework. The frontend was developed using React, providing a dynamic and interactive user interface. React components interacted seamlessly with the Django backend through the REST API to fetch and update data. Bootstrap was employed for styling, ensuring a responsive and visually appealing design across various devices.",
      "git_url": "https://github.com/mm-3/rest-ify",
      "name": "Web app for restaurants (Restify)"
    },
    {
      "description": "Developed a note-taking application using the MERN stack to enhance user productivity. The backend was implemented with Node.js and Express.js to manage server-side operations, handle CRUD operations, and ensure efficient request processing. MongoDB was used for flexible data storage, and JWT authentication secured user access. Implemented the frontend with React to provide an intuitive UI for secure login, note viewing, and note creation.",
      "git_url": null,
      "name": "Web app for notes"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a cluster administration system using bash scripts to manage a 10-node Rocky Linux 9 cluster interconnected via a network switch with internal IPv4 addresses. The system collects and stores cluster specifications and resource usage in a PostgreSQL database for future resource planning. The system was implemented with Docker containerization to ensure functionality across cluster machines. Development was tracked with Git and source code is stored on GitHub. Cron jobs were utilized to facilitate real-time monitoring.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Implemented a Java Stock Quote command-line application that allows users to simulate a personal stock wallet. Integrated an external API into the application to fetch real-time stock data, ensuring up-to-date information. Technologies utilized in this project include JDBC for database interactions, PostgreSQL for the database management system, Maven for application dependency management and project building, and Docker for containerization and distribution. The application was thoroughly tested using JUnit and Mockito through various unit and integration tests.",
        "Grep App: Implemented a Java grep application that emulates the Linux 'grep' CLI command, enabling users to search files for matching regular expression input. Created with Core Java and Maven, the application captures efficient use of functional programming through Java 8 Lambda Expressions and Stream APIs. SLF4J was employed for logging and the program was manually tested and debugged with IntelliJ. Finally, the application was Dockerized to allow for easy deployment and consistent execution across different environments."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": [
        "Angular Trading App: Developed a dynamic frontend application using TypeScript and Angular, designed to interface seamlessly with a Spring Boot backend for trading data. Implemented key features including a comprehensive dashboard for viewing and managing traders, a daily quotes list, and detailed trader profiles with functionalities for creating new traders, adding quotes, and managing account funds. The application was containerized using Docker for streamlined deployment and source code was managed through GitHub. Unit tests were conducted to ensure the reliability and accuracy of the application's features, covering various aspects such as component interactions, service logic, and data integrity.",
        "Express Trading App: Developed a robust backend application for a trading system using Node.js with the Express framework, seamlessly integrated with a MySQL database for data persistence. The application provides a RESTful API that enables functionalities such as adding, deleting, and retrieving traders, viewing stock quotes, and managing trader accounts. Key features include tracking transaction history, managing account balances, and supporting actions like deposits and withdrawals. Designed to support frontend interactions, the backend allows traders to efficiently check stock quotes, monitor account balances, and review their transaction history, ensuring a comprehensive and user-centric trading experience."
      ],
      "git_url": "/javascript",
      "name": "Javascript Apps"
    },
    {
      "description": "Developed a PoC project to migrate on-premise servers to Microsoft Azure, deploying a trading data microservice using Azure Cloud Services such as VMs, Load Balancers, and Kubernetes. Designed a scalable and secure architecture with Azure AKS for auto-scaling, load balancing, and high availability, while integrating Azure Container Registry for efficient Docker image management. Additionally, implemented a CI/CD pipeline using Jenkins to automate the software development lifecycle, streamlining deployment processes and enhancing delivery speed.",
      "git_url": "/cloud_k8s_jenkins",
      "name": "Cloud/DevOps"
    },
    {
      "description": "Led a PoC analytics project to assist a client in examining customer shopping behavior to improve marketing strategies and drive revenue growth. Uncovered insights that enabled the client's marketing team to create targeted campaigns, such as personalized promotions, email marketing, and events, for both new and existing customers. The analytics were performed using Python, Jupyter Notebook, and Pandas for data manipulation and analysis, with NumPy used for numerical computations.",
      "git_url": "/python_data_analytics",
      "name": "Python Data Analytics"
    }
  ],
  "name": "Modhoop Mitra",
  "others": [
    {
      "bullets": [
        "Royal Canadian Air Cadets: Attended 3-6 week overnight training programs (Sports and Fitness/Survival Instructor) enabling myself to plan and teach lessons on such topics with a total outreach of over 500 cadets.",
        "Fitness: Regularly keep up with calisthenics workouts and stretches for physical/mental wellbeing.",
        "Competitive gaming: Reached top 1% in games including Valorant, Teamfight Tactics, etc."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Utilized an Agile/Scrum framework while developing applications, leveraging Linux/bash, SQL, Git, Java, and Docker to deliver high-quality software solutions. Participated in regular sprint planning, daily stand-ups, and retrospective meetings to ensure iterative progress and effective collaboration. Developed Java-based applications, managed SQL databases, and optimized server performance using Linux/bash. Streamlined the deployment processes with Docker, enhancing system efficiency and reliability. Additionally, ensured version control and collaborative development using Git, facilitating CI/CD.",
      "duration": "2024-present",
      "title": "Technical Consultant"
    },
    {
      "company": "Fluid Mobility Inc.",
      "description": "Contributed to backend development by implementing a secure authentication solution for internal clients using ASP.NET Core Identity. Developed and documented API endpoints for login, registration, and token refresh, and worked closely with frontend developers to test and debug integration points, which reduced development time by 20%. Created comprehensive documentation on EMM best practices, including guides for device management, user registration, and troubleshooting, which reduced internal support ticket volumes by 40%.",
      "duration": "2023-2024",
      "title": "Jr. Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Python",
      "C#",
      "Django",
      "React",
      "ASP.NET",
      "Postman"
    ],
    "familiar": [
      "R",
      "C",
      "NumPy/Pandas",
      "Azure AKS",
      "Kubernetes",
      "Jenkins",
      "MongoDB/NoSQL",
      "Google Cloud Platform",
      "Bootstrap"
    ],
    "proficient": [
      "Java",
      "Javascript",
      "Node/Express",
      "Angular",
      "Linux/Bash",
      "RDBMS/SQL",
      "Docker",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a Software Developer with one year of experience and an Honours Bachelor of Science in Computer Science from the University of Toronto. Throughout my academic journey, I gained a solid understanding of core computer science principles through courses in Data Structures and Algorithms, Database Design, Software Design, and Web Programming. In my current role as a Technical Consultant at Jarvis Consulting Group, I am constantly improving my technical skills, staying current with industry trends, and delivering innovative solutions that exceed client expectations. Previously, as a Junior Software Engineer at Fluid Mobility, I contributed to backend development by implementing an authentication solution using ASP.NET Core Identity, which increased security and reduced internal client login related issues. I enjoy environments where growth is driven by skill development and I am eager to apply my technical skills and positive attitude to roles that allow me to contribute to the development of innovative software solutions and effectively meet user needs."
}
