{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Honours Bachelor of Science",
      "department": "Computer Science, Mathematics, Statistics",
      "duration": "2019-2023",
      "school_name": "University of Toronto"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ModhoopMitra",
  "highlighted_projects": [
    {
      "description": "Developed a full-stack social media web application focused on restaurants, utilizing Django to create and extend models for user profiles, restaurant profiles, blogs, and more. Implemented a RESTful API using the Django REST framework to facilitate rapid development within the project team. Queried and updated data through the Django ORM from a SQLite database, displaying it in a React frontend user interface. The application was designed to provide a comprehensive platform for restaurant-related interactions, implemented with efficient data management and API integration, and deployed to ensure seamless user experiences.",
      "name": "Restify"
    },
    {
      "description": "Developed a note application using the MERN stack (MongoDB, Express.js, React.js, Node.js) to enhance daily user convenience. Designed the application with a user-friendly frontend UI for logging in, viewing, and creating notes. Implemented server-side functionality with Node.js and Express.js, allowing for efficient handling of user requests and data management. Deployed the application to provide seamless access and usability for users, ensuring a reliable and intuitive note-taking experience.",
      "git_url": null,
      "name": "Web app for Notes"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Developed a cluster administration system using bash scripts to manage a 10-node Rocky Linux 9 cluster interconnected via a network switch with internal IPv4 addresses, aimed at collecting and storing data on cluster specifications and resource usage (e.g., CPU, memory) for real-time monitoring and future resource planning. Implemented the system with Docker containerization, PostgreSQL RDBMS, and cron jobs to facilitate data collection and storage.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    }
  ],
  "name": "Modhoop Mitra",
  "others": [
    {
      "bullets": [
        "Royal Canadian Air Cadets: Attended 3-6 week overnight training programs (Sports and Fitness/Survival Instructor) enabling myself to plan and teach lessons on such topics to audiences ranging from 15 to 30 cadets.",
        "Fitness: Regularly keep up with calisthenics workouts and stretches for physical/mental wellbeing.",
        "Competitive gaming: Reached top 1% in games including Valorant, Teamfight Tactics, etc."
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Utilized an Agile/Scrum framework while developing applications, leveraging Linux/bash, SQL, Git, Java, and Docker to deliver high-quality software solutions. Participated in regular sprint planning, daily stand-ups, and retrospective meetings to ensure iterative progress and effective collaboration. Developed Java-based applications, managed SQL databases, and optimized server performance using Linux/bash. Streamlined the deployment processes with Docker, enhancing system efficiency and reliability. Additionally, ensured version control and collaborative development using Git, facilitating CI/CD.",
      "duration": "2024-present",
      "title": "Software Developer"
    },
    {
      "company": "Fluid Mobility Inc.",
      "description": "Implemented secure authentication solutions to enhance the internal client login system leveraging ASP.NET reducing login issues. Investigated optimizations within legacy components of the Fluid Enterprise Mobility Management (EMM) system to improve performance and responsiveness, documented and presented findings to senior development staff. Additionally created documentation on EMM best practices, including guides for device management, user registration, and troubleshooting, to reduce internal support ticket volumes.",
      "duration": "2023-2024",
      "title": "Jr. Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "JavaScript",
      "C#",
      "Django",
      "ReactJS",
      "ASP.NET",
      "RESTful APIs"
    ],
    "familiar": [
      "R",
      "C",
      "MongoDB/NoSQL",
      "Google Cloud Platform",
      "Bootstrap",
      "Postman"
    ],
    "proficient": [
      "Python",
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Docker",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a Software Developer with 1 year of experience and a Honours Bachelor of Science in Computer Science at the University of Toronto. During my academic journey, I acquired a strong understanding of foundational computer science principles through courses pertaining to Data Structures and Algorithms, Database Design, Software Design and Web Programming. As a Software Developer at Jarvis Consulting Group, I am continuously enhancing my technical skills, staying up-to-date with industry trends, and delivering innovative solutions that meet and exceed client expectations. In my previous role as a Software Engineer at Fluid Mobility, I implemented secure authentication solutions, created and managed REST APIs and led system optimization investigations. As someone who thrives in challenging environments where growth is driven by pursuit of knowledge and skill development, I am excited to further contribute my acquired technical skills and positive attitude to roles where I can drive the development of innovative software solutions and effectively meet user needs."
}
